<!-- add-pr-comment:manifest_secrets_plan -->

# staging/manifest_secrets Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_secretsmanager_secret_version.manifest_enable_new_relic_version must be replaced
-/+ resource "aws_secretsmanager_secret_version" "manifest_enable_new_relic_version" {
      ~ arn                  = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_ENABLE_NEW_RELIC-AMNdpr" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_ENABLE_NEW_RELIC-AMNdpr|terraform-20251021165034852600000002" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20251021165034852600000002" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }
Plan: 1 to add, 0 to change, 1 to destroy.

# --- End of Plan 1 ---